Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[395 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusには現在 https://github.com/quarkusio/quarkus/graphs/contributors[395人の貢献者]がいます。皆様、本当にありがとうございました。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[417 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長しており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[417人の貢献者] がいます。一人ひとりに多くの感謝の意を表します。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[445 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長しており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[445人の貢献者]がいます。一人ひとりの貢献者に多くの感謝の意を表します。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[461 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在の link:https://github.com/quarkusio/quarkus/graphs/contributors[コントリビューターは461名]となっています。それぞれの方に深く感謝いたします。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[496 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在496名の方に link:https://github.com/quarkusio/quarkus/graphs/contributors[ご協力いただいて]います。皆さまに感謝いたします。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[511 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkus コミュニティは成長しており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[378人のコントリビューター] がいます。一人一人に多くの感謝の意を表します。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[533 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[533名の方にご協力]いただいています。それぞれの方に感謝します。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[542 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長しており、現在 https://github.com/quarkusio/quarkus/graphs/contributors[395人の貢献者] がいます。一人ひとりのコントリビューターに多くの感謝の意を表します。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[549 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[549名のコントリビューター] がいます。それぞれの方に感謝します。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[560 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[560名のコントリビューター]がいます。一人ひとりに多くの感謝の意を表します。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[577 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[577名のコントリビューター]がいます。それぞれの方に感謝します。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[586 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在の link:https://github.com/quarkusio/quarkus/graphs/contributors[コントリビューター]数は link:https://github.com/quarkusio/quarkus/graphs/contributors[586名]となっています。それぞれの方に感謝します。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[632 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[632名のコントリビューター] がいます。彼ら一人ひとりに感謝します。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[656 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[656名のコントリビューター] がいます。それぞれの方に感謝します。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[678 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[678名のコントリビューター] がいます。それぞれの方に感謝します。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[691 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[691名のコントリビューター] がいます。それぞれの方に感謝します。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[705 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[705名のコントリビューター] がいます。その一人一人に多くの感謝を捧げます。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[719 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[719名のコントリビューター] がいます。それぞれの方々に感謝します。

source: The Quarkus community is growing and now has https://github.com/quarkusio/quarkus/graphs/contributors[788 contributors]. Many, many thanks to each and every one of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[788名のコントリビューター] がいます。その一人一人に深く感謝します。

source: The Quarkus community publishes thoughtful how-to videos to help you get started. Check them out on <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">YouTube</a>.
ja_jp: Quarkus コミュニティは入門をお手伝いする為に親切なハウツー・ビデオを公開しています。<a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">YouTube</a> でチェックしてみて下さい。

source: The Quarkus configuration for Vale is in `docs/.vale.ini`.
ja_jp: ValeのQuarkusの設定は、 `docs/.vale.ini` にあります。

source: The Quarkus container supports startup and shutdown lifecycle events to notify components of the container startup and shutdown. There are CDI events fired that components can observe are illustrated in this example:
ja_jp: Quarkus コンテナーは、起動とシャットダウンのライフサイクルイベントをサポートして、コンテナーの起動とシャットダウンをコンポーネントに通知します。次の例のように、コンポーネントが監視できる CDI イベントが発生します。

source: The Quarkus dev tools, such as the https://quarkus.io/guides/cli-tooling[Quarkus CLI], the https://quarkus.io/guides/maven-tooling[Maven] and the https://quarkus.io/guides/gradle-tooling[Gradle] plugins, or https://code.quarkus.io[code.quarkus.io] can be used to list and search the Quarkus ecosystem for extensions that match a certain criteria. That includes the https://quarkus.io/guides/platform[Quarkus platform] extensions and various other extensions contributed by the community, many of which are hosted on the https://github.com/quarkiverse[Quarkiverse Hub].
ja_jp: link:https://quarkus.io/guides/cli-tooling[Quarkus CLI] 、 link:https://quarkus.io/guides/maven-tooling[Maven] 、 link:https://quarkus.io/guides/gradle-tooling[Gradle] プラグインなどのQuarkus開発ツール、または link:https://code.quarkus.io[code.quarkus.io] は、Quarkusエコシステムを一覧表示し、特定の条件に一致するエクステンションを検索することができます。これには、 link:https://quarkus.io/guides/platform[Quarkusプラットフォーム] のエクステンションや、コミュニティによって貢献されたその他のさまざまなエクステンションが含まれ、その多くは link:https://github.com/quarkiverse[Quarkiverse Hub] でホストされています。

source: The Quarkus dev tools, such as the xref:cli-tooling.adoc[Quarkus CLI], the xref:maven-tooling.adoc[Maven] and the xref:gradle-tooling.adoc[Gradle] plugins, or https://code.quarkus.io[code.quarkus.io] can be used to list and search the Quarkus ecosystem for extensions that match a certain criteria. That includes the xref:platform.adoc[Quarkus platform] extensions and various other extensions contributed by the community, many of which are hosted on the https://github.com/quarkiverse[Quarkiverse Hub].
ja_jp: Quarkus xref:cli-tooling.adoc[CLI] 、 xref:maven-tooling.adoc[Maven] 、 xref:gradle-tooling.adoc[Gradle] プラグインなどのQuarkus開発ツール、または link:https://code.quarkus.io[code.quarkus.io] を使用して、Quarkusエコシステムを一覧表示し、特定の条件に一致するエクステンションを検索できます。Quarkusエコシステムには、 xref:platform.adoc[Quarkusプラットフォーム] エクステンションや、コミュニティによって提供されたその他のさまざまなエクステンションが含まれ、その多くは link:https://github.com/quarkiverse[Quarkiverse Hub] でホストされています。

source: The Quarkus doc templates are located in the `src/main/asciidoc/_templates` directory within the `docs` module of the link:{quarkus-base-url}/tree/main/docs[Quarkus GitHub repository].
ja_jp: Quarkus ドキュメントテンプレートは、link:{quarkus-base-url}/tree/main/docs[Quarkus GitHub リポジトリー] の `docs` モジュール内の `src/main/asciidoc/_templates` ディレクトリーにあります。

source: The Quarkus extension ecosystem consists of the Quarkus extensions developed and maintained by the community, including the Quarkus core development team. While the Quarkus ecosystem (sometimes also referred to as the "Quarkus universe") includes all the Quarkus extensions ever developed, there is also a concept of a Quarkus platform.
ja_jp: Quarkusエクステンションエコシステムは、Quarkusコア開発チームを含むコミュニティによって開発・保守されたQuarkusエクステンションで構成されています。Quarkusエコシステム（"Quarkus universe"と呼ばれることもあります）には、これまでに開発されたすべてのQuarkusエクステンションが含まれていますが、Quarkusプラットフォームという概念もあります。

source: The Quarkus extension for Hibernate ORM supports injecting link:{hibernate-orm-docs-url}#basic-jpa-convert[attribute converters] and link:{hibernate-orm-docs-url}#events-jpa-callbacks[entity listeners] into Hibernate ORM.
ja_jp: Hibernate ORM 用の Quarkus エクステンションは、 link:{hibernate-orm-docs-url}#basic-jpa-convert[属性コンバーター] と link:{hibernate-orm-docs-url}#events-jpa-callbacks[エンティティーリスナー] の Hibernate ORM への注入をサポートしています。

source: The Quarkus extension for Hibernate ORM will automatically inject components annotated with `@PersistenceUnitExtension` into Hibernate Search.
ja_jp: Hibernate ORM 用の Quarkus エクステンションは、 `@PersistenceUnitExtension` アノテーションが付いたコンポーネントを Hibernate Search に自動的に注入します。

source: The Quarkus extension for Hibernate Search Standalone will automatically inject components annotated with `@SearchExtension` into Hibernate Search.
ja_jp: Hibernate Search Standalone の Quarkus エクステンションは自動的に `@SearchExtension` アノテーションが付けられたコンポーネントを Hibernate Search に注入します。

source: The Quarkus extension for Hibernate Search with Hibernate ORM will automatically inject components annotated with `@SearchExtension` into Hibernate Search.
ja_jp: Hibernate Search with Hibernate ORM の Quarkus エクステンションは自動的に `@SearchExtension` アノテーションが付けられたコンポーネントを Hibernate Search に注入します。

source: The Quarkus extension for Kafka Streams allows for very fast turnaround times during development by supporting the Quarkus Dev Mode (e.g. via `./mvnw compile quarkus:dev`). After changing the code of your Kafka Streams topology, the application will automatically be reloaded when the next input message arrives.
ja_jp: Kafka Streams用のQuarkusエクステンションを使用すると、Quarkus Dev Modeをサポートすることで、開発期間を非常に短縮することができます(例: `./mvnw compile quarkus:dev` を参照)。Kafka Streamsトポロジーのコードを変更した後、次の入力メッセージが到着すると、アプリケーションが自動的にリロードされます。

source: The Quarkus extension for Kafka Streams allows for very fast turnaround times during development by supporting the Quarkus Dev Mode (e.g. via `./mvnw quarkus:dev`). After changing the code of your Kafka Streams topology, the application will automatically be reloaded when the next input message arrives.
ja_jp: Quarkus Extension for Kafka Streamsを使用すると、Quarkus Dev Mode（例： `./mvnw quarkus:dev` ）をサポートするため、開発中のターンアラウンドタイムが非常に速くなります。 Kafka Streamsトポロジーのコードを変更すると、次の入力メッセージが届いたときにアプリケーションが自動的にリロードされます。

source: The Quarkus extension for Kafka Streams enables the execution of stream processing applications natively via GraalVM without further configuration.
ja_jp: Kafka Streams用のQuarkusエクステンションを使用すると、GraalVMを介してストリーム処理アプリケーションをネイティブ実行することができます。

source: The Quarkus extension framework results in significantly improved resource utilization even when GraalVM is not used (e.g. in HotSpot). Let’s list the actions an extension performs:
ja_jp: Quarkusエクステンションフレームワークは、GraalVMを使用していない場合（HotSpotなど）でも、リソース利用率を大幅に改善します。エクステンションが実行するアクションをリストアップしてみましょう:

source: The Quarkus extension provides a factory to initialize a Liquibase instance
ja_jp: Quarkusエクステンションは、Liquibaseインスタンスを初期化するためのファクトリーを提供します。

source: The Quarkus extension reports startup, readiness and liveness of each channel managed by the Pulsar connector. Health checks rely on the Pulsar client to verify that a connection is established with the broker.
ja_jp: Quarkus エクステンションは、Pulsar コネクターによって管理される各チャネルの起動、準備状況、および稼働状況を報告します。 ヘルスチェックは、Pulsar クライアントに依存してブローカーとの接続が確立されていることを確認します。

source: The Quarkus file log handler supports log file rotation.
ja_jp: Quarkus ファイルログハンドラーは、ログファイルのローテーションをサポートします。

source: The Quarkus file log handler supports log file rotation. Log file rotation ensures effective log file management over time by maintaining a specified number of backup log files, while also keeping the primary log file up-to-date and manageable.
ja_jp: Quarkusのファイルログハンドラーは、ログファイルのローテーションをサポートしています。 ログファイルのローテーションは、指定された数のバックアップログファイルを維持し、プライマリログファイルを最新の状態に保ち、管理しやすくすることで、長期間にわたって効果的なログファイル管理を実現します。

source: The Quarkus gRPC extension integrate gRPC in Quarkus application. It:
ja_jp: QuarkusのgRPCエクステンションは、QuarkusアプリケーションにgRPCを統合します。それは

source: The Quarkus orderer can also be disabled entirely by setting another `ClassOrderer` using the JUnit configuration. This is only permitted in cases where all Quarkus tests would run on the same application (that is, the use of test profiles and test resources is limited).
ja_jp: Quarkus のオーダーは、JUnit の設定を使用して別の `ClassOrderer` を設定することで、完全に無効にすることもできます。これは、すべての Quarkus テストが同じアプリケーション上で実行される場合 (つまり、テストプロファイルとテストリソースの使用が制限される場合) にのみ許可されます。

source: The Quarkus plugin leverages the Gradle mechanisms of up-to-date checks and the build cache. The build cache can be local or local _plus_ a remote cache server or, if configured in CI environments, remote in the sense of retrieving and storing the whole cache as an artifact, for example using link:https://github.com/gradle/gradle-build-action[Gradle's GitHub action] or directly/manually GitHub's link:https://github.com/actions/cache[GitHub's cache action].
ja_jp: Quarkusプラグインは、最新のチェックとビルドキャッシュというgradleのメカニズムを活用します。ビルドキャッシュは、ローカル、ローカル _＋_ リモートキャッシュサーバー、またはCI環境で構成されている場合は、 link:https://github.com/gradle/gradle-build-action[GradleのGitHubアクション] や直接/手動でGitHubの link:https://github.com/actions/cache[GitHubのキャッシュ] アクションを使用するなど、キャッシュ全体をアーティファクトとして取得し保存する意味でリモートとすることができます。

source: The Quarkus project has a single endpoint and the related class looks like this:
ja_jp: Quarkus プロジェクトには単一のエンドポイントがあり、関連するクラスは次のようになります。

source: The Quarkus project wizard adds a new codestarts option, allowing to enable/disable codestarts generation for Quarkus extensions that support this feature.
ja_jp: Quarkusプロジェクトウィザードに新しいcodestartsオプションが追加され、この機能をサポートするQuarkusエクステンションのcodestarts生成を有効/無効にすることができるようになりました。

source: The Quarkus project wizard now highlights codestarts enabled extension with a specific icon (right to the extension name), similar to code.quarkus.io, allowing users to better identify codestarts enabled extensions.
ja_jp: Quarkusプロジェクトウィザードでは、code.quarkus.ioと同様に、codestartsを有効にしたエクステンションを特定のアイコン（エクステンション名の右側）で強調表示するようになり、ユーザーはcodestartsを有効にしたエクステンションをよりよく識別できるようになりました。

source: The Quarkus project wizard, on top of being super snappy, now offers easy (de)selection of extensions by double-clicking on them.
ja_jp: Quarkusのプロジェクトウィザードは、超スムーズであることに加え、拡張子をダブルクリックすることで簡単に（解除）選択できるようになりました。

source: The Quarkus service retrieves verification keys from the OIDC provider. The verification keys are used to verify the bearer access token signatures.
ja_jp: Quarkus サービスが、OIDC プロバイダーから検証キーを取得します。 検証キーは、ベアラーアクセストークンの署名を検証するために使用されます。

source: The Quarkus service retrieves verification keys from the OpenID Connect provider. The verification keys are used to verify the bearer access token signatures.
ja_jp: Quarkusサービスでは、OpenID Connectプロバイダーから検証キーを取得します。検証キーは、Bearerアクセストークンの署名を検証するために使用されます。

source: The Quarkus service verifies the bearer access token signature by using the verification keys, checks the token expiry date and other claims, allows the request to proceed if the token is valid, and returns the service response to the client.
ja_jp: Quarkus サービスが、検証キーを使用してベアラーアクセストークンの署名を検証し、トークンの有効期限やその他のクレームをチェックします。トークンが有効であればリクエストの続行を許可し、サービスレスポンスをクライアントに返します。

source: The Quarkus service verifies the bearer access token signature by using the verification keys, checks the token expiry date and other claims, allows the request to proceed if the token is valid, and returns the service response to the single-page application.
ja_jp: Quarkus サービスが、検証キーを使用してベアラーアクセストークンの署名を検証し、トークンの有効期限やその他のクレームをチェックします。トークンが有効であればリクエストの続行を許可し、シングルページアプリケーションにサービスレスポンスを返します。

source: The Quarkus service verifies the bearer access token signature using the verification keys, checks the token expiry date and other claims, allows the request to proceed if the token is valid, and returns the service response to the Client.
ja_jp: Quarkusサービスは、検証キーを使用してBearerアクセストークンの署名を検証し、トークンの有効期限やその他のクレームをチェックし、トークンが有効であればリクエストの実行を許可し、サービスレスポンスをクライアントに返します。

source: The Quarkus service verifies the bearer access token signature using the verification keys, checks the token expiry date and other claims, allows the request to proceed if the token is valid, and returns the service response to the Single-page application.
ja_jp: Quarkusサービスは、検証キーを使用してBearerアクセストークンの署名を検証し、トークンの有効期限やその他のクレームをチェックし、トークンが有効であればリクエストを続行させ、サービス応答をシングルページアプリケーションに返します。

source: The Quarkus style rules are in YAML format in the `docs/.vale/styles` directory.
ja_jp: Quarkusのスタイルルールは、 `docs/.vale/styles` ディレクトリにあるYAMLフォーマットです。

source: The Quarkus team and community take all security bugs very seriously. You can find our guidelines here regarding our policy and security disclosure.
ja_jp: Quarkusのチームとコミュニティは、すべてのセキュリティーバグを非常に深刻に受け止めています。ポリシーとセキュリティー開示に関するQuarkusのガイドラインはこちらをご覧ください。

source: The Quarkus team has limited knowledge, from Maven download numbers, of the remarkable growth of Quarkus and the number of users reporting issues/concerns. Still, we need more insight into the platforms, operating system, Java combinations, and build tools our users employ. The build analytics tool aims to provide us with this information.
ja_jp: Quarkusチームは、Quarkusの著しい成長を示すMavenのダウンロード数と 、問題や懸念を報告するユーザー数について、限られた知識しか持っていません。それでも、ユーザーが使用しているプラットフォーム、オペレーティングシステム、Javaの組み合わせ、ビルドツールに関するより多くの情報が必要です。ビルド分析ツールは、この情報を提供することを目的としています。

source: The Quarkus team is exploring various alternatives to bridging the gap between the JPA and Reactive worlds.
ja_jp: Quarkus チームは、JPA と Reactive の間のギャップを埋めるために、さまざまな代替案を模索しています。

source: The Quarkus team is proud to announce the availability of the Final release of Quarkus 2.0.
ja_jp: Quarkusチームは、Quarkus 2.0のファイナルリリースを発表しました。

source: The Quarkus team started experimenting with Loom's virtual threads and https://github.com/quarkusio/quarkus/pull/24942[a first pull request] was merged.
ja_jp: QuarkusチームはLoomの仮想スレッドの実験を開始し、 link:https://github.com/quarkusio/quarkus/pull/24942[最初のプルリクエスト] がマージされました。

source: The Quarkus team will get you started with the boring stuff of setting up a brand new repository and deployment scripts, so you'll have fun coding it.
ja_jp: Quarkusチームは、ブランドの新しいリポジトリやデプロイメントスクリプトを設定するという退屈な作業すませるので、あなたは楽しくコーディングを行うことができます。

source: The Quarkus user accesses the Single-page application.
ja_jp: Quarkusユーザーは、シングルページアプリケーションにアクセスします。

source: The Quarkus user accesses the single-page application (SPA).
ja_jp: Quarkus ユーザーが、シングルページアプリケーション (SPA) にアクセスします。

source: The Quarkus user requests access to a Quarkus `web-app` application.
ja_jp: Quarkus ユーザーは、Quarkus `web-app` アプリケーションへのアクセスをリクエストします。

source: The Quarkus user requests access to a Quarkus web-app application.
ja_jp: Quarkusユーザーが、Quarkus web-appアプリケーションへのアクセスを要求します。

source: The Quarkus version range this extension requires. Optional, and will be set automatically by using the `built-with-quarkus-core` as the minimum range.
ja_jp: このエクステンションに必要な Quarkus バージョンの範囲。オプションであり、最小範囲として `built-with-quarkus-core` を使用して自動的に設定されます。

source: The Quarkus web-app exchanges this authorization code with the OIDC provider for ID, access, and refresh tokens.
ja_jp: Quarkus web-app は、この認可コードを OIDC プロバイダーと交換し、ID、アクセス、およびリフレッシュの各トークンを取得します。

source: The Quarkus web-app redirects the user to the authorization endpoint, that is, the OIDC provider for authentication.
ja_jp: Quarkus web-app は、ユーザーを認可エンドポイント、つまり認証用の OIDC プロバイダーにリダイレクトします。

source: The Quickstart
ja_jp: クイックスタート

source: The Quickstart Flow
ja_jp: クイックスタートの流れ

source: The Quinoa extension takes care of all the Web UI build/wiring/dev-mode hassles to let you focus of your Quarkus web application logic.
ja_jp: Quinoaエクステンションを使用すると、ウェブUIのビルド、結合、開発モードに関するすべての面倒な作業の面倒を見てくれ、Quarkusのウェブアプリケーションロジックに集中することができます。

source: The Quote object
ja_jp: 見積オブジェクト

source: The Qute Web extension allows you to directly serve via HTTP templates located in `src/main/resources/templates/pub/`. In that case you don't need any Java code to "plug" the template, for example, the template `src/main/resources/templates/pub/foo.html` will be served from the paths `/foo` and `/foo.html` by default.
ja_jp: Qute Web エクステンションを使用すると、`src/main/resources/templates/pub/` にある HTTP テンプレートを介して直接提供できます。その場合、テンプレートを "接続" するための Java コードは必要ありません。たとえば、テンプレート `src/main/resources/templates/pub/foo.html` は、デフォルトでパス `/foo` および `/foo.html` から提供されます。

source: The Qute Web extension, while hosted in the Quarkiverse, is part of the Quarkus Platform and its version is defined in the Quarkus Platform BOM.
ja_jp: Quarkiverse でホストされている Qute Web エクステンションは、Quarkus プラットフォームの一部であり、そのバージョンは Quarkus プラットフォーム BOM で定義されています。

source: The Qute language server has support for built-in and user-defined Java classes, including parameter completion and validation for their methods. Take advantage of this to easily avoid Java related mistakes.
ja_jp: Qute言語サーバーは、ビルトインおよびユーザー定義のJavaクラスをサポートしており、そのメソッドに対するパラメータ補完や検証を行うことができます。これを利用して、Javaに関連するミスを簡単に回避してください。

source: The Qute parser has been rewritten to allow for proper syntax coloration:
ja_jp: Quteパーサーは、適切な構文の色分けができるように書き直されました：

source: The REST Client (`quarkus-rest-client` and its dependencies) replaces the legacy RESTEasy Classic-based `quarkus-resteasy-client` and leverages Quarkus' build time processing and the unified I/O model provided by Vert.x.
ja_jp: REST クライアント (`quarkus-rest-client`とその依存関係) は、従来の RESTEasy Classic ベースの `quarkus-resteasy-client` を置き換え、Quarkus のビルド時処理と Vert.x が提供する統合 I/O モデルを活用します。

source: The REST Client Reactive internally uses https://vertx.io/docs/apidocs/io/vertx/core/http/HttpClient.html[the Vert.x HTTP Client] to make the network connections. The REST Client Reactive extensions allows configuring some settings via properties, for example:
ja_jp: REST Client Reactive は、内部的に https://vertx.io/docs/apidocs/io/vertx/core/http/HttpClient.html[Vert.x HTTP クライアント] を使用して、ネットワーク接続をします。REST Client Reactiveのエクステンションでは、プロパティを使っていくつか設定できます。例えば、

source: The REST Client falls back onto the Quarkus wide `quarkus.http.enable-compression` configuration property (which defaults to `false`) if no REST Client specific property is set.
ja_jp: RESTクライアント固有のプロパティが設定されていない場合、RESTクライアントはQuarkus全体の `quarkus.http.enable-compression` 設定プロパティ（デフォルトは `false` ）にフォールバックします。

source: The REST Client interface and the front end API
ja_jp: RESTクライアントインターフェースとフロントエンドAPI
